Revit 2026 API

# ViewPrint Method

---

Print this view with the default view template and using the print setting of the current active document.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void Print()
```
```vb
Public Sub Print
```
```cpp
public:
void Print()
```
```fsharp
member Print : unit -> unit
```

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Thrown when the view cannot be printed. |

#### Reference

View Class

Print Overload

Autodesk.Revit.DB Namespace